MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/atdf/PIC32MX250F128D.atdf
      <value-group caption="Edge Sequence Enable bit" name="CTMUCON__EDGSEQEN">
         <value caption="Edge1 must occur before Edge2 can occur" name="" value="0x1" />
         <value caption="No edge sequence is needed" name="" value="0x0" />
      </value-group>
      <value-group caption="Edge Enable bit" name="CTMUCON__EDGEN">
         <value caption="Edges are not blocked" name="" value="0x1" />
         <value caption="Edges are blocked" name="" value="0x0" />
      </value-group>
      <value-group caption="Time Generation Enable bit" name="CTMUCON__TGEN">
         <value caption="Enables edge delay generation" name="" value="0x1" />
         <value caption="Disables edge delay generation" name="" value="0x0" />
      </value-group>
      <value-group caption="Stop-in-Idle Mode bit" name="CTMUCON__CTMUSIDL">
         <value caption="Discontinue module operation when device enters Idle mode" name="" value="0x1" />
         <value caption="Continue module operation in Idle mode" name="" value="0x0" />
      </value-group>
      <value-group caption="ON Enable bit" name="CTMUCON__ON">
         <value caption="Module is enabled" name="" value="0x1" />
         <value caption="Module is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Edge 2 Source Select bits" name="CTMUCON__EDG2SEL">
         <value caption="C3OUT pin is selected" name="" value="0xf" />
         <value caption="C2OUT pin is selected" name="" value="0xe" />
         <value caption="C1OUT pin is selected" name="" value="0xd" />
         <value caption="PBCLK clock is selected" name="" value="0xc" />
         <value caption="IC3 Capture Event is selected" name="" value="0xb" />
         <value caption="IC2 Capture Event is selected" name="" value="0xa" />
         <value caption="IC1 Capture Event is selected" name="" value="0x9" />
         <value caption="CTED13 pin is selected" name="" value="0x8" />
         <value caption="CTED12 pin is selected" name="" value="0x7" />
         <value caption="CTED11 pin is selected" name="" value="0x6" />
         <value caption="CTED10 pin is selected" name="" value="0x5" />
         <value caption="CTED9 pin is selected" name="" value="0x4" />
         <value caption="CTED1 pin is selected" name="" value="0x3" />
         <value caption="CTED2 pin is selected" name="" value="0x2" />
         <value caption="OC1 Compare Event is selected" name="" value="0x1" />
         <value caption="Timer1 Event is selected" name="" value="0x0" />
      </value-group>     
      <value-group caption="Edge 2 Polarity Select bit" name="CTMUCON__EDG2POL">
         <value caption="Edge2 programmed for a positive edge response" name="" value="0x1" />
         <value caption="Edge2 programmed for a negative edge response" name="" value="0x0" />
      </value-group>
      <value-group caption="Edge2 Edge Sampling Select bit" name="CTMUCON__EDG2MOD">
         <value caption="Input is edge-sensitive" name="" value="0x1" />
         <value caption="Input is level-sensitive" name="" value="0x0" />
      </value-group>
      <value-group caption="Edge1 Status bit" name="CTMUCON__EDG1STAT">
         <value caption="Edge1 has occurred" name="" value="0x1" />
         <value caption="Edge1 has not occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="Edge2 Status bit" name="CTMUCON__EDG2STAT">
         <value caption="Edge2 has occurred" name="" value="0x1" />
         <value caption="Edge2 has not occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="Edge 1 Source Select bits" name="CTMUCON__EDG1SEL">
         <value caption="C3OUT pin is selected" name="" value="0xf" />
         <value caption="C2OUT pin is selected" name="" value="0xe" />
         <value caption="C1OUT pin is selected" name="" value="0xd" />
         <value caption="IC3 Capture Event is selected" name="" value="0xc" />
         <value caption="IC2 Capture Event is selected" name="" value="0xb" />
         <value caption="IC1 Capture Event is selected" name="" value="0xa" />
         <value caption="CTED8 pin is selected" name="" value="0x9" />
         <value caption="CTED7 pin is selected" name="" value="0x8" />
         <value caption="CTED6 pin is selected" name="" value="0x7" />
         <value caption="CTED5 pin is selected" name="" value="0x6" />
         <value caption="CTED4 pin is selected" name="" value="0x5" />
         <value caption="CTED3 pin is selected" name="" value="0x4" />
         <value caption="CTED1 pin is selected" name="" value="0x3" />
         <value caption="CTED2 pin is selected" name="" value="0x2" />
         <value caption="OC1 Compare Event is selected" name="" value="0x1" />
         <value caption="Timer1 Event is selected" name="" value="0x0" />
      </value-group>
      <value-group caption="Edge 1 Polarity Select bit" name="CTMUCON__EDG1POL">
         <value caption="Edge1 programmed for a positive edge response" name="" value="0x1" />
         <value caption="Edge1 programmed for a negative edge response" name="" value="0x0" />
      </value-group>
      <value-group caption="Edge1 Edge Sampling Select bit" name="CTMUCON__EDG1MOD">
         <value caption="Input is edge-sensitive" name="" value="0x1" />
         <value caption="Input is level-sensitive" name="" value="0x0" />
      </value-group>
   </module>
   <module caption="" id="00800" name="CVR" version="1">
      <register-group name="CVR">
         <register caption="Comparator Voltage Reference Control Register" name="CVRCON" offset="0x0" rw="RW" size="4">
            <bitfield caption="CVref Value Selection" mask="0x0000000F" name="CVR" values="CVRCON__CVR" />
            <bitfield caption="CVref Source Selection bit" mask="0x00000010" name="CVRSS" values="CVRCON__CVRSS" />
            <bitfield caption="CVref Range Selection bit" mask="0x00000020" name="CVRR" values="CVRCON__CVRR" />
            <bitfield caption="CVrefout Enable bit" mask="0x00000040" name="CVROE" values="CVRCON__CVROE" />
            <bitfield caption="Comparator Voltage Reference On bit" mask="0x00004000" name="ON" values="CVRCON__ON" />
         </register>
      </register-group>
      <value-group caption="CVref Value Selection" name="CVRCON__CVR">
         <value caption="(When CVRR is 1) CVREF is (15/24) * CVRSRC / (When CVRR is 0) CVREF is CVRSRC/4 + (15/32)*CVRSRC" name="" value="0xf" />
         <value caption="(When CVRR is 1) CVREF is (14/24) * CVRSRC / (When CVRR is 0) CVREF is CVRSRC/4 + (14/32)*CVRSRC" name="" value="0xe" />
         <value caption="(When CVRR is 1) CVREF is (13/24) * CVRSRC / (When CVRR is 0) CVREF is CVRSRC/4 + (13/32)*CVRSRC" name="" value="0xd" />
         <value caption="(When CVRR is 1) CVREF is (12/24) * CVRSRC / (When CVRR is 0) CVREF is CVRSRC/4 + (12/32)*CVRSRC" name="" value="0xc" />
         <value caption="(When CVRR is 1) CVREF is (11/24) * CVRSRC / (When CVRR is 0) CVREF is CVRSRC/4 + (11/32)*CVRSRC" name="" value="0xb" />
         <value caption="(When CVRR is 1) CVREF is (10/24) * CVRSRC / (When CVRR is 0) CVREF is CVRSRC/4 + (10/32)*CVRSRC" name="" value="0xa" />
         <value caption="(When CVRR is 1) CVREF is (9/24) * CVRSRC / (When CVRR is 0) CVREF is CVRSRC/4 + (9/32)*CVRSRC" name="" value="0x9" />
         <value caption="(When CVRR is 1) CVREF is (8/24) * CVRSRC / (When CVRR is 0) CVREF is CVRSRC/4 + (8/32)*CVRSRC" name="" value="0x8" />
         <value caption="(When CVRR is 1) CVREF is (7/24) * CVRSRC / (When CVRR is 0) CVREF is CVRSRC/4 + (7/32)*CVRSRC" name="" value="0x7" />
         <value caption="(When CVRR is 1) CVREF is (6/24) * CVRSRC / (When CVRR is 0) CVREF is CVRSRC/4 + (6/32)*CVRSRC" name="" value="0x6" />
         <value caption="(When CVRR is 1) CVREF is (5/24) * CVRSRC / (When CVRR is 0) CVREF is CVRSRC/4 + (5/32)*CVRSRC" name="" value="0x5" />
         <value caption="(When CVRR is 1) CVREF is (4/24) * CVRSRC / (When CVRR is 0) CVREF is CVRSRC/4 + (4/32)*CVRSRC" name="" value="0x4" />
         <value caption="(When CVRR is 1) CVREF is (3/24) * CVRSRC / (When CVRR is 0) CVREF is CVRSRC/4 + (3/32)*CVRSRC" name="" value="0x3" />
         <value caption="(When CVRR is 1) CVREF is (2/24) * CVRSRC / (When CVRR is 0) CVREF is CVRSRC/4 + (2/32)*CVRSRC" name="" value="0x2" />
         <value caption="(When CVRR is 1) CVREF is (1/24) * CVRSRC / (When CVRR is 0) CVREF is CVRSRC/4 + (1/32)*CVRSRC" name="" value="0x1" />
         <value caption="(When CVRR is 1) CVREF is (0/24) * CVRSRC / (When CVRR is 0) CVREF is CVRSRC/4 + (0/32)*CVRSRC" name="" value="0x0" />
      </value-group>
      <value-group caption="CVref Source Selection bit" name="CVRCON__CVRSS">
         <value caption="Comparator voltage reference source CVrsrc = (Vref+) - (Vref-)" name="" value="0x1" />
         <value caption="Comparator voltage reference source CVrsrc = AVdd - AVss" name="" value="0x0" />
      </value-group>
